{
	"nodes":[
		{"op":"null","name":"Input","attrs":{},"inputs":[]},
		{"op":"null","name":"1.State","attrs":{},"inputs":[]},
		{"op":"null","name":"2.State","attrs":{},"inputs":[]},
		{"op":"null","name":"1.InputGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.InputGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.InputGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"1.ResetGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.ResetGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.ResetGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"1.MemoryGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.MemoryGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"1.MemoryGateBiases","attrs":{},"inputs":[]},
		{"op":"SliceChannel","name":"1$0","attrs":{"axis":"1","num_outputs":"30","squeeze_axis":"true"},"inputs":[[0,0,0]]},
		{"op":"FullyConnected","name":"1$1","attrs":{"num_hidden":"512"},"inputs":[[12,0,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$2","attrs":{"num_hidden":"512"},"inputs":[[12,1,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$3","attrs":{"num_hidden":"512"},"inputs":[[12,2,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$4","attrs":{"num_hidden":"512"},"inputs":[[12,3,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$5","attrs":{"num_hidden":"512"},"inputs":[[12,4,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$6","attrs":{"num_hidden":"512"},"inputs":[[12,5,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$7","attrs":{"num_hidden":"512"},"inputs":[[12,6,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$8","attrs":{"num_hidden":"512"},"inputs":[[12,7,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$9","attrs":{"num_hidden":"512"},"inputs":[[12,8,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$10","attrs":{"num_hidden":"512"},"inputs":[[12,9,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$11","attrs":{"num_hidden":"512"},"inputs":[[12,10,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$12","attrs":{"num_hidden":"512"},"inputs":[[12,11,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$13","attrs":{"num_hidden":"512"},"inputs":[[12,12,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$14","attrs":{"num_hidden":"512"},"inputs":[[12,13,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$15","attrs":{"num_hidden":"512"},"inputs":[[12,14,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$16","attrs":{"num_hidden":"512"},"inputs":[[12,15,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$17","attrs":{"num_hidden":"512"},"inputs":[[12,16,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$18","attrs":{"num_hidden":"512"},"inputs":[[12,17,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$19","attrs":{"num_hidden":"512"},"inputs":[[12,18,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$20","attrs":{"num_hidden":"512"},"inputs":[[12,19,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$21","attrs":{"num_hidden":"512"},"inputs":[[12,20,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$22","attrs":{"num_hidden":"512"},"inputs":[[12,21,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$23","attrs":{"num_hidden":"512"},"inputs":[[12,22,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$24","attrs":{"num_hidden":"512"},"inputs":[[12,23,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$25","attrs":{"num_hidden":"512"},"inputs":[[12,24,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$26","attrs":{"num_hidden":"512"},"inputs":[[12,25,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$27","attrs":{"num_hidden":"512"},"inputs":[[12,26,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$28","attrs":{"num_hidden":"512"},"inputs":[[12,27,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$29","attrs":{"num_hidden":"512"},"inputs":[[12,28,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$30","attrs":{"num_hidden":"512"},"inputs":[[12,29,0],[3,0,0],[5,0,0]]},
		{"op":"FullyConnected","name":"1$31","attrs":{"num_hidden":"512"},"inputs":[[12,0,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$32","attrs":{"num_hidden":"512"},"inputs":[[12,1,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$33","attrs":{"num_hidden":"512"},"inputs":[[12,2,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$34","attrs":{"num_hidden":"512"},"inputs":[[12,3,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$35","attrs":{"num_hidden":"512"},"inputs":[[12,4,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$36","attrs":{"num_hidden":"512"},"inputs":[[12,5,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$37","attrs":{"num_hidden":"512"},"inputs":[[12,6,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$38","attrs":{"num_hidden":"512"},"inputs":[[12,7,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$39","attrs":{"num_hidden":"512"},"inputs":[[12,8,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$40","attrs":{"num_hidden":"512"},"inputs":[[12,9,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$41","attrs":{"num_hidden":"512"},"inputs":[[12,10,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$42","attrs":{"num_hidden":"512"},"inputs":[[12,11,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$43","attrs":{"num_hidden":"512"},"inputs":[[12,12,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$44","attrs":{"num_hidden":"512"},"inputs":[[12,13,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$45","attrs":{"num_hidden":"512"},"inputs":[[12,14,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$46","attrs":{"num_hidden":"512"},"inputs":[[12,15,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$47","attrs":{"num_hidden":"512"},"inputs":[[12,16,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$48","attrs":{"num_hidden":"512"},"inputs":[[12,17,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$49","attrs":{"num_hidden":"512"},"inputs":[[12,18,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$50","attrs":{"num_hidden":"512"},"inputs":[[12,19,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$51","attrs":{"num_hidden":"512"},"inputs":[[12,20,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$52","attrs":{"num_hidden":"512"},"inputs":[[12,21,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$53","attrs":{"num_hidden":"512"},"inputs":[[12,22,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$54","attrs":{"num_hidden":"512"},"inputs":[[12,23,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$55","attrs":{"num_hidden":"512"},"inputs":[[12,24,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$56","attrs":{"num_hidden":"512"},"inputs":[[12,25,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$57","attrs":{"num_hidden":"512"},"inputs":[[12,26,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$58","attrs":{"num_hidden":"512"},"inputs":[[12,27,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$59","attrs":{"num_hidden":"512"},"inputs":[[12,28,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$60","attrs":{"num_hidden":"512"},"inputs":[[12,29,0],[6,0,0],[8,0,0]]},
		{"op":"FullyConnected","name":"1$61","attrs":{"num_hidden":"512"},"inputs":[[12,0,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$62","attrs":{"num_hidden":"512"},"inputs":[[12,1,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$63","attrs":{"num_hidden":"512"},"inputs":[[12,2,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$64","attrs":{"num_hidden":"512"},"inputs":[[12,3,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$65","attrs":{"num_hidden":"512"},"inputs":[[12,4,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$66","attrs":{"num_hidden":"512"},"inputs":[[12,5,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$67","attrs":{"num_hidden":"512"},"inputs":[[12,6,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$68","attrs":{"num_hidden":"512"},"inputs":[[12,7,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$69","attrs":{"num_hidden":"512"},"inputs":[[12,8,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$70","attrs":{"num_hidden":"512"},"inputs":[[12,9,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$71","attrs":{"num_hidden":"512"},"inputs":[[12,10,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$72","attrs":{"num_hidden":"512"},"inputs":[[12,11,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$73","attrs":{"num_hidden":"512"},"inputs":[[12,12,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$74","attrs":{"num_hidden":"512"},"inputs":[[12,13,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$75","attrs":{"num_hidden":"512"},"inputs":[[12,14,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$76","attrs":{"num_hidden":"512"},"inputs":[[12,15,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$77","attrs":{"num_hidden":"512"},"inputs":[[12,16,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$78","attrs":{"num_hidden":"512"},"inputs":[[12,17,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$79","attrs":{"num_hidden":"512"},"inputs":[[12,18,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$80","attrs":{"num_hidden":"512"},"inputs":[[12,19,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$81","attrs":{"num_hidden":"512"},"inputs":[[12,20,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$82","attrs":{"num_hidden":"512"},"inputs":[[12,21,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$83","attrs":{"num_hidden":"512"},"inputs":[[12,22,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$84","attrs":{"num_hidden":"512"},"inputs":[[12,23,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$85","attrs":{"num_hidden":"512"},"inputs":[[12,24,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$86","attrs":{"num_hidden":"512"},"inputs":[[12,25,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$87","attrs":{"num_hidden":"512"},"inputs":[[12,26,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$88","attrs":{"num_hidden":"512"},"inputs":[[12,27,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$89","attrs":{"num_hidden":"512"},"inputs":[[12,28,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$90","attrs":{"num_hidden":"512"},"inputs":[[12,29,0],[9,0,0],[11,0,0]]},
		{"op":"FullyConnected","name":"1$91","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[1,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$92","attrs":{},"inputs":[[13,0,0],[103,0,0]]},
		{"op":"sigmoid","name":"1$93","attrs":{},"inputs":[[104,0,0]]},
		{"op":"FullyConnected","name":"1$94","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[1,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$95","attrs":{},"inputs":[[43,0,0],[106,0,0]]},
		{"op":"sigmoid","name":"1$96","attrs":{},"inputs":[[107,0,0]]},
		{"op":"FullyConnected","name":"1$97","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[1,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$98","attrs":{},"inputs":[[108,0,0],[109,0,0]]},
		{"op":"_Plus","name":"1$99","attrs":{},"inputs":[[73,0,0],[110,0,0]]},
		{"op":"tanh","name":"1$100","attrs":{},"inputs":[[111,0,0]]},
		{"op":"_RMinusScalar","name":"1$101","attrs":{"scalar":"1.0"},"inputs":[[105,0,0]]},
		{"op":"_Mul","name":"1$102","attrs":{},"inputs":[[112,0,0],[113,0,0]]},
		{"op":"_Mul","name":"1$103","attrs":{},"inputs":[[1,0,0],[105,0,0]]},
		{"op":"_Plus","name":"1$104","attrs":{},"inputs":[[114,0,0],[115,0,0]]},
		{"op":"FullyConnected","name":"1$105","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[116,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$106","attrs":{},"inputs":[[14,0,0],[117,0,0]]},
		{"op":"sigmoid","name":"1$107","attrs":{},"inputs":[[118,0,0]]},
		{"op":"FullyConnected","name":"1$108","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[116,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$109","attrs":{},"inputs":[[44,0,0],[120,0,0]]},
		{"op":"sigmoid","name":"1$110","attrs":{},"inputs":[[121,0,0]]},
		{"op":"FullyConnected","name":"1$111","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[116,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$112","attrs":{},"inputs":[[122,0,0],[123,0,0]]},
		{"op":"_Plus","name":"1$113","attrs":{},"inputs":[[74,0,0],[124,0,0]]},
		{"op":"tanh","name":"1$114","attrs":{},"inputs":[[125,0,0]]},
		{"op":"_RMinusScalar","name":"1$115","attrs":{"scalar":"1.0"},"inputs":[[119,0,0]]},
		{"op":"_Mul","name":"1$116","attrs":{},"inputs":[[126,0,0],[127,0,0]]},
		{"op":"_Mul","name":"1$117","attrs":{},"inputs":[[116,0,0],[119,0,0]]},
		{"op":"_Plus","name":"1$118","attrs":{},"inputs":[[128,0,0],[129,0,0]]},
		{"op":"FullyConnected","name":"1$119","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[130,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$120","attrs":{},"inputs":[[15,0,0],[131,0,0]]},
		{"op":"sigmoid","name":"1$121","attrs":{},"inputs":[[132,0,0]]},
		{"op":"FullyConnected","name":"1$122","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[130,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$123","attrs":{},"inputs":[[45,0,0],[134,0,0]]},
		{"op":"sigmoid","name":"1$124","attrs":{},"inputs":[[135,0,0]]},
		{"op":"FullyConnected","name":"1$125","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[130,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$126","attrs":{},"inputs":[[136,0,0],[137,0,0]]},
		{"op":"_Plus","name":"1$127","attrs":{},"inputs":[[75,0,0],[138,0,0]]},
		{"op":"tanh","name":"1$128","attrs":{},"inputs":[[139,0,0]]},
		{"op":"_RMinusScalar","name":"1$129","attrs":{"scalar":"1.0"},"inputs":[[133,0,0]]},
		{"op":"_Mul","name":"1$130","attrs":{},"inputs":[[140,0,0],[141,0,0]]},
		{"op":"_Mul","name":"1$131","attrs":{},"inputs":[[130,0,0],[133,0,0]]},
		{"op":"_Plus","name":"1$132","attrs":{},"inputs":[[142,0,0],[143,0,0]]},
		{"op":"FullyConnected","name":"1$133","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[144,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$134","attrs":{},"inputs":[[16,0,0],[145,0,0]]},
		{"op":"sigmoid","name":"1$135","attrs":{},"inputs":[[146,0,0]]},
		{"op":"FullyConnected","name":"1$136","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[144,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$137","attrs":{},"inputs":[[46,0,0],[148,0,0]]},
		{"op":"sigmoid","name":"1$138","attrs":{},"inputs":[[149,0,0]]},
		{"op":"FullyConnected","name":"1$139","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[144,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$140","attrs":{},"inputs":[[150,0,0],[151,0,0]]},
		{"op":"_Plus","name":"1$141","attrs":{},"inputs":[[76,0,0],[152,0,0]]},
		{"op":"tanh","name":"1$142","attrs":{},"inputs":[[153,0,0]]},
		{"op":"_RMinusScalar","name":"1$143","attrs":{"scalar":"1.0"},"inputs":[[147,0,0]]},
		{"op":"_Mul","name":"1$144","attrs":{},"inputs":[[154,0,0],[155,0,0]]},
		{"op":"_Mul","name":"1$145","attrs":{},"inputs":[[144,0,0],[147,0,0]]},
		{"op":"_Plus","name":"1$146","attrs":{},"inputs":[[156,0,0],[157,0,0]]},
		{"op":"FullyConnected","name":"1$147","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[158,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$148","attrs":{},"inputs":[[17,0,0],[159,0,0]]},
		{"op":"sigmoid","name":"1$149","attrs":{},"inputs":[[160,0,0]]},
		{"op":"FullyConnected","name":"1$150","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[158,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$151","attrs":{},"inputs":[[47,0,0],[162,0,0]]},
		{"op":"sigmoid","name":"1$152","attrs":{},"inputs":[[163,0,0]]},
		{"op":"FullyConnected","name":"1$153","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[158,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$154","attrs":{},"inputs":[[164,0,0],[165,0,0]]},
		{"op":"_Plus","name":"1$155","attrs":{},"inputs":[[77,0,0],[166,0,0]]},
		{"op":"tanh","name":"1$156","attrs":{},"inputs":[[167,0,0]]},
		{"op":"_RMinusScalar","name":"1$157","attrs":{"scalar":"1.0"},"inputs":[[161,0,0]]},
		{"op":"_Mul","name":"1$158","attrs":{},"inputs":[[168,0,0],[169,0,0]]},
		{"op":"_Mul","name":"1$159","attrs":{},"inputs":[[158,0,0],[161,0,0]]},
		{"op":"_Plus","name":"1$160","attrs":{},"inputs":[[170,0,0],[171,0,0]]},
		{"op":"FullyConnected","name":"1$161","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[172,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$162","attrs":{},"inputs":[[18,0,0],[173,0,0]]},
		{"op":"sigmoid","name":"1$163","attrs":{},"inputs":[[174,0,0]]},
		{"op":"FullyConnected","name":"1$164","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[172,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$165","attrs":{},"inputs":[[48,0,0],[176,0,0]]},
		{"op":"sigmoid","name":"1$166","attrs":{},"inputs":[[177,0,0]]},
		{"op":"FullyConnected","name":"1$167","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[172,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$168","attrs":{},"inputs":[[178,0,0],[179,0,0]]},
		{"op":"_Plus","name":"1$169","attrs":{},"inputs":[[78,0,0],[180,0,0]]},
		{"op":"tanh","name":"1$170","attrs":{},"inputs":[[181,0,0]]},
		{"op":"_RMinusScalar","name":"1$171","attrs":{"scalar":"1.0"},"inputs":[[175,0,0]]},
		{"op":"_Mul","name":"1$172","attrs":{},"inputs":[[182,0,0],[183,0,0]]},
		{"op":"_Mul","name":"1$173","attrs":{},"inputs":[[172,0,0],[175,0,0]]},
		{"op":"_Plus","name":"1$174","attrs":{},"inputs":[[184,0,0],[185,0,0]]},
		{"op":"FullyConnected","name":"1$175","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[186,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$176","attrs":{},"inputs":[[19,0,0],[187,0,0]]},
		{"op":"sigmoid","name":"1$177","attrs":{},"inputs":[[188,0,0]]},
		{"op":"FullyConnected","name":"1$178","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[186,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$179","attrs":{},"inputs":[[49,0,0],[190,0,0]]},
		{"op":"sigmoid","name":"1$180","attrs":{},"inputs":[[191,0,0]]},
		{"op":"FullyConnected","name":"1$181","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[186,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$182","attrs":{},"inputs":[[192,0,0],[193,0,0]]},
		{"op":"_Plus","name":"1$183","attrs":{},"inputs":[[79,0,0],[194,0,0]]},
		{"op":"tanh","name":"1$184","attrs":{},"inputs":[[195,0,0]]},
		{"op":"_RMinusScalar","name":"1$185","attrs":{"scalar":"1.0"},"inputs":[[189,0,0]]},
		{"op":"_Mul","name":"1$186","attrs":{},"inputs":[[196,0,0],[197,0,0]]},
		{"op":"_Mul","name":"1$187","attrs":{},"inputs":[[186,0,0],[189,0,0]]},
		{"op":"_Plus","name":"1$188","attrs":{},"inputs":[[198,0,0],[199,0,0]]},
		{"op":"FullyConnected","name":"1$189","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[200,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$190","attrs":{},"inputs":[[20,0,0],[201,0,0]]},
		{"op":"sigmoid","name":"1$191","attrs":{},"inputs":[[202,0,0]]},
		{"op":"FullyConnected","name":"1$192","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[200,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$193","attrs":{},"inputs":[[50,0,0],[204,0,0]]},
		{"op":"sigmoid","name":"1$194","attrs":{},"inputs":[[205,0,0]]},
		{"op":"FullyConnected","name":"1$195","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[200,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$196","attrs":{},"inputs":[[206,0,0],[207,0,0]]},
		{"op":"_Plus","name":"1$197","attrs":{},"inputs":[[80,0,0],[208,0,0]]},
		{"op":"tanh","name":"1$198","attrs":{},"inputs":[[209,0,0]]},
		{"op":"_RMinusScalar","name":"1$199","attrs":{"scalar":"1.0"},"inputs":[[203,0,0]]},
		{"op":"_Mul","name":"1$200","attrs":{},"inputs":[[210,0,0],[211,0,0]]},
		{"op":"_Mul","name":"1$201","attrs":{},"inputs":[[200,0,0],[203,0,0]]},
		{"op":"_Plus","name":"1$202","attrs":{},"inputs":[[212,0,0],[213,0,0]]},
		{"op":"FullyConnected","name":"1$203","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[214,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$204","attrs":{},"inputs":[[21,0,0],[215,0,0]]},
		{"op":"sigmoid","name":"1$205","attrs":{},"inputs":[[216,0,0]]},
		{"op":"FullyConnected","name":"1$206","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[214,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$207","attrs":{},"inputs":[[51,0,0],[218,0,0]]},
		{"op":"sigmoid","name":"1$208","attrs":{},"inputs":[[219,0,0]]},
		{"op":"FullyConnected","name":"1$209","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[214,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$210","attrs":{},"inputs":[[220,0,0],[221,0,0]]},
		{"op":"_Plus","name":"1$211","attrs":{},"inputs":[[81,0,0],[222,0,0]]},
		{"op":"tanh","name":"1$212","attrs":{},"inputs":[[223,0,0]]},
		{"op":"_RMinusScalar","name":"1$213","attrs":{"scalar":"1.0"},"inputs":[[217,0,0]]},
		{"op":"_Mul","name":"1$214","attrs":{},"inputs":[[224,0,0],[225,0,0]]},
		{"op":"_Mul","name":"1$215","attrs":{},"inputs":[[214,0,0],[217,0,0]]},
		{"op":"_Plus","name":"1$216","attrs":{},"inputs":[[226,0,0],[227,0,0]]},
		{"op":"FullyConnected","name":"1$217","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[228,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$218","attrs":{},"inputs":[[22,0,0],[229,0,0]]},
		{"op":"sigmoid","name":"1$219","attrs":{},"inputs":[[230,0,0]]},
		{"op":"FullyConnected","name":"1$220","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[228,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$221","attrs":{},"inputs":[[52,0,0],[232,0,0]]},
		{"op":"sigmoid","name":"1$222","attrs":{},"inputs":[[233,0,0]]},
		{"op":"FullyConnected","name":"1$223","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[228,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$224","attrs":{},"inputs":[[234,0,0],[235,0,0]]},
		{"op":"_Plus","name":"1$225","attrs":{},"inputs":[[82,0,0],[236,0,0]]},
		{"op":"tanh","name":"1$226","attrs":{},"inputs":[[237,0,0]]},
		{"op":"_RMinusScalar","name":"1$227","attrs":{"scalar":"1.0"},"inputs":[[231,0,0]]},
		{"op":"_Mul","name":"1$228","attrs":{},"inputs":[[238,0,0],[239,0,0]]},
		{"op":"_Mul","name":"1$229","attrs":{},"inputs":[[228,0,0],[231,0,0]]},
		{"op":"_Plus","name":"1$230","attrs":{},"inputs":[[240,0,0],[241,0,0]]},
		{"op":"FullyConnected","name":"1$231","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[242,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$232","attrs":{},"inputs":[[23,0,0],[243,0,0]]},
		{"op":"sigmoid","name":"1$233","attrs":{},"inputs":[[244,0,0]]},
		{"op":"FullyConnected","name":"1$234","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[242,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$235","attrs":{},"inputs":[[53,0,0],[246,0,0]]},
		{"op":"sigmoid","name":"1$236","attrs":{},"inputs":[[247,0,0]]},
		{"op":"FullyConnected","name":"1$237","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[242,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$238","attrs":{},"inputs":[[248,0,0],[249,0,0]]},
		{"op":"_Plus","name":"1$239","attrs":{},"inputs":[[83,0,0],[250,0,0]]},
		{"op":"tanh","name":"1$240","attrs":{},"inputs":[[251,0,0]]},
		{"op":"_RMinusScalar","name":"1$241","attrs":{"scalar":"1.0"},"inputs":[[245,0,0]]},
		{"op":"_Mul","name":"1$242","attrs":{},"inputs":[[252,0,0],[253,0,0]]},
		{"op":"_Mul","name":"1$243","attrs":{},"inputs":[[242,0,0],[245,0,0]]},
		{"op":"_Plus","name":"1$244","attrs":{},"inputs":[[254,0,0],[255,0,0]]},
		{"op":"FullyConnected","name":"1$245","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[256,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$246","attrs":{},"inputs":[[24,0,0],[257,0,0]]},
		{"op":"sigmoid","name":"1$247","attrs":{},"inputs":[[258,0,0]]},
		{"op":"FullyConnected","name":"1$248","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[256,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$249","attrs":{},"inputs":[[54,0,0],[260,0,0]]},
		{"op":"sigmoid","name":"1$250","attrs":{},"inputs":[[261,0,0]]},
		{"op":"FullyConnected","name":"1$251","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[256,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$252","attrs":{},"inputs":[[262,0,0],[263,0,0]]},
		{"op":"_Plus","name":"1$253","attrs":{},"inputs":[[84,0,0],[264,0,0]]},
		{"op":"tanh","name":"1$254","attrs":{},"inputs":[[265,0,0]]},
		{"op":"_RMinusScalar","name":"1$255","attrs":{"scalar":"1.0"},"inputs":[[259,0,0]]},
		{"op":"_Mul","name":"1$256","attrs":{},"inputs":[[266,0,0],[267,0,0]]},
		{"op":"_Mul","name":"1$257","attrs":{},"inputs":[[256,0,0],[259,0,0]]},
		{"op":"_Plus","name":"1$258","attrs":{},"inputs":[[268,0,0],[269,0,0]]},
		{"op":"FullyConnected","name":"1$259","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[270,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$260","attrs":{},"inputs":[[25,0,0],[271,0,0]]},
		{"op":"sigmoid","name":"1$261","attrs":{},"inputs":[[272,0,0]]},
		{"op":"FullyConnected","name":"1$262","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[270,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$263","attrs":{},"inputs":[[55,0,0],[274,0,0]]},
		{"op":"sigmoid","name":"1$264","attrs":{},"inputs":[[275,0,0]]},
		{"op":"FullyConnected","name":"1$265","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[270,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$266","attrs":{},"inputs":[[276,0,0],[277,0,0]]},
		{"op":"_Plus","name":"1$267","attrs":{},"inputs":[[85,0,0],[278,0,0]]},
		{"op":"tanh","name":"1$268","attrs":{},"inputs":[[279,0,0]]},
		{"op":"_RMinusScalar","name":"1$269","attrs":{"scalar":"1.0"},"inputs":[[273,0,0]]},
		{"op":"_Mul","name":"1$270","attrs":{},"inputs":[[280,0,0],[281,0,0]]},
		{"op":"_Mul","name":"1$271","attrs":{},"inputs":[[270,0,0],[273,0,0]]},
		{"op":"_Plus","name":"1$272","attrs":{},"inputs":[[282,0,0],[283,0,0]]},
		{"op":"FullyConnected","name":"1$273","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[284,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$274","attrs":{},"inputs":[[26,0,0],[285,0,0]]},
		{"op":"sigmoid","name":"1$275","attrs":{},"inputs":[[286,0,0]]},
		{"op":"FullyConnected","name":"1$276","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[284,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$277","attrs":{},"inputs":[[56,0,0],[288,0,0]]},
		{"op":"sigmoid","name":"1$278","attrs":{},"inputs":[[289,0,0]]},
		{"op":"FullyConnected","name":"1$279","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[284,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$280","attrs":{},"inputs":[[290,0,0],[291,0,0]]},
		{"op":"_Plus","name":"1$281","attrs":{},"inputs":[[86,0,0],[292,0,0]]},
		{"op":"tanh","name":"1$282","attrs":{},"inputs":[[293,0,0]]},
		{"op":"_RMinusScalar","name":"1$283","attrs":{"scalar":"1.0"},"inputs":[[287,0,0]]},
		{"op":"_Mul","name":"1$284","attrs":{},"inputs":[[294,0,0],[295,0,0]]},
		{"op":"_Mul","name":"1$285","attrs":{},"inputs":[[284,0,0],[287,0,0]]},
		{"op":"_Plus","name":"1$286","attrs":{},"inputs":[[296,0,0],[297,0,0]]},
		{"op":"FullyConnected","name":"1$287","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[298,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$288","attrs":{},"inputs":[[27,0,0],[299,0,0]]},
		{"op":"sigmoid","name":"1$289","attrs":{},"inputs":[[300,0,0]]},
		{"op":"FullyConnected","name":"1$290","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[298,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$291","attrs":{},"inputs":[[57,0,0],[302,0,0]]},
		{"op":"sigmoid","name":"1$292","attrs":{},"inputs":[[303,0,0]]},
		{"op":"FullyConnected","name":"1$293","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[298,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$294","attrs":{},"inputs":[[304,0,0],[305,0,0]]},
		{"op":"_Plus","name":"1$295","attrs":{},"inputs":[[87,0,0],[306,0,0]]},
		{"op":"tanh","name":"1$296","attrs":{},"inputs":[[307,0,0]]},
		{"op":"_RMinusScalar","name":"1$297","attrs":{"scalar":"1.0"},"inputs":[[301,0,0]]},
		{"op":"_Mul","name":"1$298","attrs":{},"inputs":[[308,0,0],[309,0,0]]},
		{"op":"_Mul","name":"1$299","attrs":{},"inputs":[[298,0,0],[301,0,0]]},
		{"op":"_Plus","name":"1$300","attrs":{},"inputs":[[310,0,0],[311,0,0]]},
		{"op":"FullyConnected","name":"1$301","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[312,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$302","attrs":{},"inputs":[[28,0,0],[313,0,0]]},
		{"op":"sigmoid","name":"1$303","attrs":{},"inputs":[[314,0,0]]},
		{"op":"FullyConnected","name":"1$304","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[312,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$305","attrs":{},"inputs":[[58,0,0],[316,0,0]]},
		{"op":"sigmoid","name":"1$306","attrs":{},"inputs":[[317,0,0]]},
		{"op":"FullyConnected","name":"1$307","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[312,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$308","attrs":{},"inputs":[[318,0,0],[319,0,0]]},
		{"op":"_Plus","name":"1$309","attrs":{},"inputs":[[88,0,0],[320,0,0]]},
		{"op":"tanh","name":"1$310","attrs":{},"inputs":[[321,0,0]]},
		{"op":"_RMinusScalar","name":"1$311","attrs":{"scalar":"1.0"},"inputs":[[315,0,0]]},
		{"op":"_Mul","name":"1$312","attrs":{},"inputs":[[322,0,0],[323,0,0]]},
		{"op":"_Mul","name":"1$313","attrs":{},"inputs":[[312,0,0],[315,0,0]]},
		{"op":"_Plus","name":"1$314","attrs":{},"inputs":[[324,0,0],[325,0,0]]},
		{"op":"FullyConnected","name":"1$315","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[326,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$316","attrs":{},"inputs":[[29,0,0],[327,0,0]]},
		{"op":"sigmoid","name":"1$317","attrs":{},"inputs":[[328,0,0]]},
		{"op":"FullyConnected","name":"1$318","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[326,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$319","attrs":{},"inputs":[[59,0,0],[330,0,0]]},
		{"op":"sigmoid","name":"1$320","attrs":{},"inputs":[[331,0,0]]},
		{"op":"FullyConnected","name":"1$321","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[326,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$322","attrs":{},"inputs":[[332,0,0],[333,0,0]]},
		{"op":"_Plus","name":"1$323","attrs":{},"inputs":[[89,0,0],[334,0,0]]},
		{"op":"tanh","name":"1$324","attrs":{},"inputs":[[335,0,0]]},
		{"op":"_RMinusScalar","name":"1$325","attrs":{"scalar":"1.0"},"inputs":[[329,0,0]]},
		{"op":"_Mul","name":"1$326","attrs":{},"inputs":[[336,0,0],[337,0,0]]},
		{"op":"_Mul","name":"1$327","attrs":{},"inputs":[[326,0,0],[329,0,0]]},
		{"op":"_Plus","name":"1$328","attrs":{},"inputs":[[338,0,0],[339,0,0]]},
		{"op":"FullyConnected","name":"1$329","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[340,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$330","attrs":{},"inputs":[[30,0,0],[341,0,0]]},
		{"op":"sigmoid","name":"1$331","attrs":{},"inputs":[[342,0,0]]},
		{"op":"FullyConnected","name":"1$332","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[340,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$333","attrs":{},"inputs":[[60,0,0],[344,0,0]]},
		{"op":"sigmoid","name":"1$334","attrs":{},"inputs":[[345,0,0]]},
		{"op":"FullyConnected","name":"1$335","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[340,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$336","attrs":{},"inputs":[[346,0,0],[347,0,0]]},
		{"op":"_Plus","name":"1$337","attrs":{},"inputs":[[90,0,0],[348,0,0]]},
		{"op":"tanh","name":"1$338","attrs":{},"inputs":[[349,0,0]]},
		{"op":"_RMinusScalar","name":"1$339","attrs":{"scalar":"1.0"},"inputs":[[343,0,0]]},
		{"op":"_Mul","name":"1$340","attrs":{},"inputs":[[350,0,0],[351,0,0]]},
		{"op":"_Mul","name":"1$341","attrs":{},"inputs":[[340,0,0],[343,0,0]]},
		{"op":"_Plus","name":"1$342","attrs":{},"inputs":[[352,0,0],[353,0,0]]},
		{"op":"FullyConnected","name":"1$343","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[354,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$344","attrs":{},"inputs":[[31,0,0],[355,0,0]]},
		{"op":"sigmoid","name":"1$345","attrs":{},"inputs":[[356,0,0]]},
		{"op":"FullyConnected","name":"1$346","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[354,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$347","attrs":{},"inputs":[[61,0,0],[358,0,0]]},
		{"op":"sigmoid","name":"1$348","attrs":{},"inputs":[[359,0,0]]},
		{"op":"FullyConnected","name":"1$349","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[354,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$350","attrs":{},"inputs":[[360,0,0],[361,0,0]]},
		{"op":"_Plus","name":"1$351","attrs":{},"inputs":[[91,0,0],[362,0,0]]},
		{"op":"tanh","name":"1$352","attrs":{},"inputs":[[363,0,0]]},
		{"op":"_RMinusScalar","name":"1$353","attrs":{"scalar":"1.0"},"inputs":[[357,0,0]]},
		{"op":"_Mul","name":"1$354","attrs":{},"inputs":[[364,0,0],[365,0,0]]},
		{"op":"_Mul","name":"1$355","attrs":{},"inputs":[[354,0,0],[357,0,0]]},
		{"op":"_Plus","name":"1$356","attrs":{},"inputs":[[366,0,0],[367,0,0]]},
		{"op":"FullyConnected","name":"1$357","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[368,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$358","attrs":{},"inputs":[[32,0,0],[369,0,0]]},
		{"op":"sigmoid","name":"1$359","attrs":{},"inputs":[[370,0,0]]},
		{"op":"FullyConnected","name":"1$360","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[368,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$361","attrs":{},"inputs":[[62,0,0],[372,0,0]]},
		{"op":"sigmoid","name":"1$362","attrs":{},"inputs":[[373,0,0]]},
		{"op":"FullyConnected","name":"1$363","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[368,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$364","attrs":{},"inputs":[[374,0,0],[375,0,0]]},
		{"op":"_Plus","name":"1$365","attrs":{},"inputs":[[92,0,0],[376,0,0]]},
		{"op":"tanh","name":"1$366","attrs":{},"inputs":[[377,0,0]]},
		{"op":"_RMinusScalar","name":"1$367","attrs":{"scalar":"1.0"},"inputs":[[371,0,0]]},
		{"op":"_Mul","name":"1$368","attrs":{},"inputs":[[378,0,0],[379,0,0]]},
		{"op":"_Mul","name":"1$369","attrs":{},"inputs":[[368,0,0],[371,0,0]]},
		{"op":"_Plus","name":"1$370","attrs":{},"inputs":[[380,0,0],[381,0,0]]},
		{"op":"FullyConnected","name":"1$371","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[382,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$372","attrs":{},"inputs":[[33,0,0],[383,0,0]]},
		{"op":"sigmoid","name":"1$373","attrs":{},"inputs":[[384,0,0]]},
		{"op":"FullyConnected","name":"1$374","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[382,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$375","attrs":{},"inputs":[[63,0,0],[386,0,0]]},
		{"op":"sigmoid","name":"1$376","attrs":{},"inputs":[[387,0,0]]},
		{"op":"FullyConnected","name":"1$377","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[382,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$378","attrs":{},"inputs":[[388,0,0],[389,0,0]]},
		{"op":"_Plus","name":"1$379","attrs":{},"inputs":[[93,0,0],[390,0,0]]},
		{"op":"tanh","name":"1$380","attrs":{},"inputs":[[391,0,0]]},
		{"op":"_RMinusScalar","name":"1$381","attrs":{"scalar":"1.0"},"inputs":[[385,0,0]]},
		{"op":"_Mul","name":"1$382","attrs":{},"inputs":[[392,0,0],[393,0,0]]},
		{"op":"_Mul","name":"1$383","attrs":{},"inputs":[[382,0,0],[385,0,0]]},
		{"op":"_Plus","name":"1$384","attrs":{},"inputs":[[394,0,0],[395,0,0]]},
		{"op":"FullyConnected","name":"1$385","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[396,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$386","attrs":{},"inputs":[[34,0,0],[397,0,0]]},
		{"op":"sigmoid","name":"1$387","attrs":{},"inputs":[[398,0,0]]},
		{"op":"FullyConnected","name":"1$388","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[396,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$389","attrs":{},"inputs":[[64,0,0],[400,0,0]]},
		{"op":"sigmoid","name":"1$390","attrs":{},"inputs":[[401,0,0]]},
		{"op":"FullyConnected","name":"1$391","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[396,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$392","attrs":{},"inputs":[[402,0,0],[403,0,0]]},
		{"op":"_Plus","name":"1$393","attrs":{},"inputs":[[94,0,0],[404,0,0]]},
		{"op":"tanh","name":"1$394","attrs":{},"inputs":[[405,0,0]]},
		{"op":"_RMinusScalar","name":"1$395","attrs":{"scalar":"1.0"},"inputs":[[399,0,0]]},
		{"op":"_Mul","name":"1$396","attrs":{},"inputs":[[406,0,0],[407,0,0]]},
		{"op":"_Mul","name":"1$397","attrs":{},"inputs":[[396,0,0],[399,0,0]]},
		{"op":"_Plus","name":"1$398","attrs":{},"inputs":[[408,0,0],[409,0,0]]},
		{"op":"FullyConnected","name":"1$399","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[410,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$400","attrs":{},"inputs":[[35,0,0],[411,0,0]]},
		{"op":"sigmoid","name":"1$401","attrs":{},"inputs":[[412,0,0]]},
		{"op":"FullyConnected","name":"1$402","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[410,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$403","attrs":{},"inputs":[[65,0,0],[414,0,0]]},
		{"op":"sigmoid","name":"1$404","attrs":{},"inputs":[[415,0,0]]},
		{"op":"FullyConnected","name":"1$405","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[410,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$406","attrs":{},"inputs":[[416,0,0],[417,0,0]]},
		{"op":"_Plus","name":"1$407","attrs":{},"inputs":[[95,0,0],[418,0,0]]},
		{"op":"tanh","name":"1$408","attrs":{},"inputs":[[419,0,0]]},
		{"op":"_RMinusScalar","name":"1$409","attrs":{"scalar":"1.0"},"inputs":[[413,0,0]]},
		{"op":"_Mul","name":"1$410","attrs":{},"inputs":[[420,0,0],[421,0,0]]},
		{"op":"_Mul","name":"1$411","attrs":{},"inputs":[[410,0,0],[413,0,0]]},
		{"op":"_Plus","name":"1$412","attrs":{},"inputs":[[422,0,0],[423,0,0]]},
		{"op":"FullyConnected","name":"1$413","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[424,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$414","attrs":{},"inputs":[[36,0,0],[425,0,0]]},
		{"op":"sigmoid","name":"1$415","attrs":{},"inputs":[[426,0,0]]},
		{"op":"FullyConnected","name":"1$416","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[424,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$417","attrs":{},"inputs":[[66,0,0],[428,0,0]]},
		{"op":"sigmoid","name":"1$418","attrs":{},"inputs":[[429,0,0]]},
		{"op":"FullyConnected","name":"1$419","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[424,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$420","attrs":{},"inputs":[[430,0,0],[431,0,0]]},
		{"op":"_Plus","name":"1$421","attrs":{},"inputs":[[96,0,0],[432,0,0]]},
		{"op":"tanh","name":"1$422","attrs":{},"inputs":[[433,0,0]]},
		{"op":"_RMinusScalar","name":"1$423","attrs":{"scalar":"1.0"},"inputs":[[427,0,0]]},
		{"op":"_Mul","name":"1$424","attrs":{},"inputs":[[434,0,0],[435,0,0]]},
		{"op":"_Mul","name":"1$425","attrs":{},"inputs":[[424,0,0],[427,0,0]]},
		{"op":"_Plus","name":"1$426","attrs":{},"inputs":[[436,0,0],[437,0,0]]},
		{"op":"FullyConnected","name":"1$427","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[438,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$428","attrs":{},"inputs":[[37,0,0],[439,0,0]]},
		{"op":"sigmoid","name":"1$429","attrs":{},"inputs":[[440,0,0]]},
		{"op":"FullyConnected","name":"1$430","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[438,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$431","attrs":{},"inputs":[[67,0,0],[442,0,0]]},
		{"op":"sigmoid","name":"1$432","attrs":{},"inputs":[[443,0,0]]},
		{"op":"FullyConnected","name":"1$433","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[438,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$434","attrs":{},"inputs":[[444,0,0],[445,0,0]]},
		{"op":"_Plus","name":"1$435","attrs":{},"inputs":[[97,0,0],[446,0,0]]},
		{"op":"tanh","name":"1$436","attrs":{},"inputs":[[447,0,0]]},
		{"op":"_RMinusScalar","name":"1$437","attrs":{"scalar":"1.0"},"inputs":[[441,0,0]]},
		{"op":"_Mul","name":"1$438","attrs":{},"inputs":[[448,0,0],[449,0,0]]},
		{"op":"_Mul","name":"1$439","attrs":{},"inputs":[[438,0,0],[441,0,0]]},
		{"op":"_Plus","name":"1$440","attrs":{},"inputs":[[450,0,0],[451,0,0]]},
		{"op":"FullyConnected","name":"1$441","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[452,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$442","attrs":{},"inputs":[[38,0,0],[453,0,0]]},
		{"op":"sigmoid","name":"1$443","attrs":{},"inputs":[[454,0,0]]},
		{"op":"FullyConnected","name":"1$444","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[452,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$445","attrs":{},"inputs":[[68,0,0],[456,0,0]]},
		{"op":"sigmoid","name":"1$446","attrs":{},"inputs":[[457,0,0]]},
		{"op":"FullyConnected","name":"1$447","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[452,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$448","attrs":{},"inputs":[[458,0,0],[459,0,0]]},
		{"op":"_Plus","name":"1$449","attrs":{},"inputs":[[98,0,0],[460,0,0]]},
		{"op":"tanh","name":"1$450","attrs":{},"inputs":[[461,0,0]]},
		{"op":"_RMinusScalar","name":"1$451","attrs":{"scalar":"1.0"},"inputs":[[455,0,0]]},
		{"op":"_Mul","name":"1$452","attrs":{},"inputs":[[462,0,0],[463,0,0]]},
		{"op":"_Mul","name":"1$453","attrs":{},"inputs":[[452,0,0],[455,0,0]]},
		{"op":"_Plus","name":"1$454","attrs":{},"inputs":[[464,0,0],[465,0,0]]},
		{"op":"FullyConnected","name":"1$455","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[466,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$456","attrs":{},"inputs":[[39,0,0],[467,0,0]]},
		{"op":"sigmoid","name":"1$457","attrs":{},"inputs":[[468,0,0]]},
		{"op":"FullyConnected","name":"1$458","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[466,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$459","attrs":{},"inputs":[[69,0,0],[470,0,0]]},
		{"op":"sigmoid","name":"1$460","attrs":{},"inputs":[[471,0,0]]},
		{"op":"FullyConnected","name":"1$461","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[466,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$462","attrs":{},"inputs":[[472,0,0],[473,0,0]]},
		{"op":"_Plus","name":"1$463","attrs":{},"inputs":[[99,0,0],[474,0,0]]},
		{"op":"tanh","name":"1$464","attrs":{},"inputs":[[475,0,0]]},
		{"op":"_RMinusScalar","name":"1$465","attrs":{"scalar":"1.0"},"inputs":[[469,0,0]]},
		{"op":"_Mul","name":"1$466","attrs":{},"inputs":[[476,0,0],[477,0,0]]},
		{"op":"_Mul","name":"1$467","attrs":{},"inputs":[[466,0,0],[469,0,0]]},
		{"op":"_Plus","name":"1$468","attrs":{},"inputs":[[478,0,0],[479,0,0]]},
		{"op":"FullyConnected","name":"1$469","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[480,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$470","attrs":{},"inputs":[[40,0,0],[481,0,0]]},
		{"op":"sigmoid","name":"1$471","attrs":{},"inputs":[[482,0,0]]},
		{"op":"FullyConnected","name":"1$472","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[480,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$473","attrs":{},"inputs":[[70,0,0],[484,0,0]]},
		{"op":"sigmoid","name":"1$474","attrs":{},"inputs":[[485,0,0]]},
		{"op":"FullyConnected","name":"1$475","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[480,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$476","attrs":{},"inputs":[[486,0,0],[487,0,0]]},
		{"op":"_Plus","name":"1$477","attrs":{},"inputs":[[100,0,0],[488,0,0]]},
		{"op":"tanh","name":"1$478","attrs":{},"inputs":[[489,0,0]]},
		{"op":"_RMinusScalar","name":"1$479","attrs":{"scalar":"1.0"},"inputs":[[483,0,0]]},
		{"op":"_Mul","name":"1$480","attrs":{},"inputs":[[490,0,0],[491,0,0]]},
		{"op":"_Mul","name":"1$481","attrs":{},"inputs":[[480,0,0],[483,0,0]]},
		{"op":"_Plus","name":"1$482","attrs":{},"inputs":[[492,0,0],[493,0,0]]},
		{"op":"FullyConnected","name":"1$483","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[494,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$484","attrs":{},"inputs":[[41,0,0],[495,0,0]]},
		{"op":"sigmoid","name":"1$485","attrs":{},"inputs":[[496,0,0]]},
		{"op":"FullyConnected","name":"1$486","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[494,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$487","attrs":{},"inputs":[[71,0,0],[498,0,0]]},
		{"op":"sigmoid","name":"1$488","attrs":{},"inputs":[[499,0,0]]},
		{"op":"FullyConnected","name":"1$489","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[494,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$490","attrs":{},"inputs":[[500,0,0],[501,0,0]]},
		{"op":"_Plus","name":"1$491","attrs":{},"inputs":[[101,0,0],[502,0,0]]},
		{"op":"tanh","name":"1$492","attrs":{},"inputs":[[503,0,0]]},
		{"op":"_RMinusScalar","name":"1$493","attrs":{"scalar":"1.0"},"inputs":[[497,0,0]]},
		{"op":"_Mul","name":"1$494","attrs":{},"inputs":[[504,0,0],[505,0,0]]},
		{"op":"_Mul","name":"1$495","attrs":{},"inputs":[[494,0,0],[497,0,0]]},
		{"op":"_Plus","name":"1$496","attrs":{},"inputs":[[506,0,0],[507,0,0]]},
		{"op":"FullyConnected","name":"1$497","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[508,0,0],[4,0,0]]},
		{"op":"_Plus","name":"1$498","attrs":{},"inputs":[[42,0,0],[509,0,0]]},
		{"op":"sigmoid","name":"1$499","attrs":{},"inputs":[[510,0,0]]},
		{"op":"FullyConnected","name":"1$500","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[508,0,0],[7,0,0]]},
		{"op":"_Plus","name":"1$501","attrs":{},"inputs":[[72,0,0],[512,0,0]]},
		{"op":"sigmoid","name":"1$502","attrs":{},"inputs":[[513,0,0]]},
		{"op":"FullyConnected","name":"1$503","attrs":{"num_hidden":"512","no_bias":"true"},"inputs":[[508,0,0],[10,0,0]]},
		{"op":"_Mul","name":"1$504","attrs":{},"inputs":[[514,0,0],[515,0,0]]},
		{"op":"_Plus","name":"1$505","attrs":{},"inputs":[[102,0,0],[516,0,0]]},
		{"op":"tanh","name":"1$506","attrs":{},"inputs":[[517,0,0]]},
		{"op":"_RMinusScalar","name":"1$507","attrs":{"scalar":"1.0"},"inputs":[[511,0,0]]},
		{"op":"_Mul","name":"1$508","attrs":{},"inputs":[[518,0,0],[519,0,0]]},
		{"op":"_Mul","name":"1$509","attrs":{},"inputs":[[508,0,0],[511,0,0]]},
		{"op":"_Plus","name":"1$510","attrs":{},"inputs":[[520,0,0],[521,0,0]]},
		{"op":"BlockGrad","name":"1.State","attrs":{},"inputs":[[522,0,0]]},
		{"op":"null","name":"2.InputGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.InputGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.InputGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"2.ResetGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.ResetGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.ResetGateBiases","attrs":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateInputWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateStateWeights","attrs":{},"inputs":[]},
		{"op":"null","name":"2.MemoryGateBiases","attrs":{},"inputs":[]},
		{"op":"FullyConnected","name":"2$0","attrs":{"num_hidden":"512"},"inputs":[[116,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$1","attrs":{"num_hidden":"512"},"inputs":[[130,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$2","attrs":{"num_hidden":"512"},"inputs":[[144,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$3","attrs":{"num_hidden":"512"},"inputs":[[158,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$4","attrs":{"num_hidden":"512"},"inputs":[[172,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$5","attrs":{"num_hidden":"512"},"inputs":[[186,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$6","attrs":{"num_hidden":"512"},"inputs":[[200,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$7","attrs":{"num_hidden":"512"},"inputs":[[214,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$8","attrs":{"num_hidden":"512"},"inputs":[[228,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$9","attrs":{"num_hidden":"512"},"inputs":[[242,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$10","attrs":{"num_hidden":"512"},"inputs":[[256,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$11","attrs":{"num_hidden":"512"},"inputs":[[270,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$12","attrs":{"num_hidden":"512"},"inputs":[[284,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$13","attrs":{"num_hidden":"512"},"inputs":[[298,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$14","attrs":{"num_hidden":"512"},"inputs":[[312,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$15","attrs":{"num_hidden":"512"},"inputs":[[326,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$16","attrs":{"num_hidden":"512"},"inputs":[[340,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$17","attrs":{"num_hidden":"512"},"inputs":[[354,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$18","attrs":{"num_hidden":"512"},"inputs":[[368,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$19","attrs":{"num_hidden":"512"},"inputs":[[382,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$20","attrs":{"num_hidden":"512"},"inputs":[[396,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$21","attrs":{"num_hidden":"512"},"inputs":[[410,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$22","attrs":{"num_hidden":"512"},"inputs":[[424,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$23","attrs":{"num_hidden":"512"},"inputs":[[438,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$24","attrs":{"num_hidden":"512"},"inputs":[[452,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$25","attrs":{"num_hidden":"512"},"inputs":[[466,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$26","attrs":{"num_hidden":"512"},"inputs":[[480,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$27","attrs":{"num_hidden":"512"},"inputs":[[494,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$28","attrs":{"num_hidden":"512"},"inputs":[[508,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$29","attrs":{"num_hidden":"512"},"inputs":[[522,0,0],[524,0,0],[526,0,0]]},
		{"op":"FullyConnected","name":"2$30","attrs":{"num_hidden":"512"},"inputs":[[116,0,0],[527,0,0],[529,0,0]]},
		{"op":"FullyConnected","name":"2$31","attrs":{"num_hidden":"512"},"inputs":[[130,0,0],[527,0,0],[529,0,0]]},
		{"op":"FullyConnected","name":"2$32","attrs":{"num_hidden":"512"},"inputs":[[144,0,0],[527,0,0],[529,0,0]]},
		{"op":"FullyConnected","name":"2$33","attrs":{"num_hidden":"512"},"inputs":[[158,0,0],[527,0,0],[529,0,0]]},
		{"op":"FullyConnected","name":"2$34","attrs":{"num_hidden":"512"},"inputs":[[172,0,0],[527,0,0],[529,0,0]]},
		{"op":"FullyConnected","name":"2$35","attrs":{"num_hidden":"512"},"inputs":[[186,0,0],[527,0,0],[529,0,0]]},
